# # 算术运算符 : + - * / // % **
# print("10 +4 = ", 10+4) # 加
# print("10 - 4 = ", 10-4) # 减法
# print("10 * 4 = ", 10*4) # 乘法
# print("10 / 4 = ", 10/4) # 除法
# print("10 // 4 = ", 10//4) # 整除
# print("10 % 4 = ", 10%4) # 求余
# print("10 ** 4 = ", 10**4) # 幂指数，10的四次方

# # 算术运算符的优先级 --> ** --> * / // % ---> + -
# print("0.1 + 10 / 4**2 = ", 0.1+10/4**2)

#案例：输入两个数x和y，计算x+y以及x-y的结果并输出
# # float(..) -- > 将其他类型 转为 浮点数类型
# x = float(input("请输入x的值:"))
# y = float(input("请输入y的值"))
#
# # 0.0999999999999999998 --> 精度损失 ; 由于计算机底层是基于 二进制 进行数据的处理 二进制无法准确的表示所有的小数，因此 涉及到浮点数的运算
# #可能会损失精度
# print("x + y = ", x + y)
# print("x - y = ", x - y)
# print("x * y = ", x * y)

# 赋值运算符
# num = 666
# num += 10
# print("num+10后, num=", num)

#############比较运算符:== != > >= < <=
# print("100==100 吗:",100 == 100)
# print("*100*-- '100′吗： ","100"=="100")
# print("100！=100吗: ",100!=100)
# print("100<100吗：",100<100)
# print("100<=100吗：",100 <=100)
# print("100>100 吗：",100>100)
# print("100 >=100吗：",100 >=100)

# 逻辑运算符
# x = float(input("请输入x的值:"))
# print( 10 < x > 20)
# n = int (input("请输入一个整数:"))
#
# # print(f"{n}在10-20之间：", n >=10 and n <=20)
# print(f"{n}不在10-20之间：", n < 10 or n >20)

